# ============================================
# PROMPT CACHING SETUP для ClimbAI Bot
# Скопируй этот файл в свой проект
# ============================================

import anthropic
import json
import asyncio
from asyncio import Semaphore
import time
import logging
from typing import Dict, List

logger = logging.getLogger(__name__)

# ============================================
# ЧАСТЬ 1: КЭШИРУЕМЫЕ ПРОМПТЫ (общие для всех)
# ============================================

# Базовые инструкции (ВСЕГДА КЭШИРУЕТСЯ)
SYSTEM_BASE = """
Ты - экспертная система ClimbAI для анализа скалолазания.
Интегрирована с BoulderVision для глубокого анализа движений.

ТВОЯ ЗАДАЧА:
Создать ПОЛНЫЙ отчет со всеми компонентами на основе данных анализа видео.

ОБЯЗАТЕЛЬНЫЕ КОМПОНЕНТЫ ОТЧЕТА:
1. 📊 ОСНОВНАЯ СТАТИСТИКА
2. ⚡ МГНОВЕННЫЙ ВЕРДИКТ  
3. 👨‍🏫 ЭКСПЕРТНЫЙ АНАЛИЗ (1 из 4 экспертов)
4. 🔬 БИОМЕХАНИЧЕСКИЙ АНАЛИЗ
5. 🧠 ПСИХОЛОГИЧЕСКИЙ ПРОФИЛЬ
6. 🏆 СРАВНЕНИЕ С БАЗОЙ СПОРТСМЕНОВ
7. 🔮 ПРЕДИКТИВНАЯ АНАЛИТИКА
8. 🎬 NETFLIX-STYLE SUMMARY
9. 🚨 АНАЛИЗ ПАДЕНИЯ (если обнаружено)
10. 📊 КЛЮЧЕВЫЕ КАДРЫ
11. ⚡ КАЙДЗЕН-ПЛАН
12. 📈 BOULDERVISION ДИНАМИКА (НОВОЕ!)
13. 🎯 АНАЛИЗ ЗАЦЕПОВ (если доступно)

КРИТИЧНО:
- НЕ приукрашивай! Качество <60% = "критическая нестабильность"
- Используй РЕАЛЬНЫЕ данные из анализа
- Будь конкретным: таймкоды, цифры, проценты
- Все рекомендации должны быть выполнимыми
- Используй BoulderVision метрики для глубокого анализа динамики
"""

# Информация об экспертах (ВСЕГДА КЭШИРУЕТСЯ)
EXPERTS_INFO = """
ЭКСПЕРТЫ (выбери 1 на основе результатов):

🎯 Magnus Midtbø - Dynamic Movement Flow
Специализация: Динамика, поток движений, флоу
Когда выбирать: Отличные результаты (80%+) или нужна критика динамики
Стиль комментариев: Позитивный, мотивирующий, с акцентом на креативность
Фирменные советы: Heel hook, динамичные перехваты, работа с импульсом

🎯 Eric Hörst - Efficiency Analysis  
Специализация: Энергоэффективность, техника экономии сил
Когда выбирать: Хорошие результаты (80%+), проблемы с выносливостью
Стиль комментариев: Технический, детальный, научный подход
Фирменные советы: Shake out, straight arm, правильное дыхание

🎯 Neil Gresham - Problem-solving
Специализация: Тактика, чтение трасс, стратегия
Когда выбирать: Средние результаты (60-80%), падения, нужен анализ
Стиль комментариев: Аналитический, обучающий, стратегический
Фирменные советы: Планирование движений, альтернативные пути, beta

🎯 Dave MacLeod - Systematic Development
Специализация: Системное развитие, долгосрочный прогресс
Когда выбирать: Средние результаты (60-80%), нужен план развития
Стиль комментариев: Методичный, структурированный, долгосрочный
Фирменные советы: Тренировочные протоколы, периодизация, прогрессии
"""

# Форматы отчетов (ВСЕГДА КЭШИРУЕТСЯ)  
FORMATS_INFO = """
ФОРМАТЫ ОТЧЕТОВ И ИХ ОСОБЕННОСТИ:

1. TECHNICAL (Технический):
   - Научный подход, терминология
   - Много цифр, графиков, процентов
   - Биомеханические детали
   - Для продвинутых скалолазов

2. CLIENT (Клиентский):
   - Дружелюбный, мотивирующий тон
   - Эмодзи и визуальные элементы
   - Позитивный подход
   - Понятный язык

3. DETECTIVE (Детектив):
   - Детективное расследование
   - Драматичный стиль
   - "Улики", "расследование", "вердикт"
   - Анализ "преступления" (падения)

4. GAMER (Геймерский):
   - RPG-стиль
   - Статы персонажа (STR, DEX, INT, END, LUCK)
   - Квесты, достижения, level up
   - Игровая терминология

5. COACH (Для тренера):
   - Профессиональный тренерский язык
   - Тренировочные протоколы
   - Микро/мезо/макроциклы
   - Научная база

6. GIRL_STYLE (Для девочек):
   - Стильный, вдохновляющий
   - Beauty-метафоры
   - Поддержка и эмпатия
   - Fashion & wellness подход

7. BEGINNER (Для новичков):
   - Простой понятный язык
   - Без сложных терминов
   - Базовые концепции
   - Много объяснений
"""

# BoulderVision метрики (НОВОЕ - ВСЕГДА КЭШИРУЕТСЯ)
BOULDERVISION_INFO = """
BOULDERVISION МЕТРИКИ ДВИЖЕНИЯ:

Система BoulderVision анализирует динамику движений скалолаза в реальном времени.
Источник: https://github.com/reiffd7/BoulderVision, https://blog.roboflow.com/bouldering/

1. VELOCITY RATIO (Коэффициент скорости):
   - Отношение текущей скорости к средней скорости за окно анализа
   - > 1.0: движение быстрее среднего (динамичный переход)
   - = 1.0: движение на среднем уровне
   - < 1.0: движение медленнее среднего (статика, отдых, раздумья)
   - Интерпретация:
     * > 2.0: Взрывное движение, возможен рывок или динамо
     * 1.3-2.0: Активное движение, хороший темп
     * 0.7-1.3: Нормальный контролируемый темп
     * < 0.7: Медленное движение, возможен поиск зацепа или отдых

2. CUMULATIVE DISTANCE (Накопленная дистанция):
   - Общее расстояние, пройденное всеми ключевыми точками тела
   - Высокое значение = много движения (динамичный стиль или лишние движения)
   - Низкое значение = экономичный стиль или статичная поза
   - Используй для выявления "лишних движений" и энергоэффективности

3. MOVEMENT PATTERN (Паттерн движения):
   - dynamic_consistent: Динамичный стабильный стиль
   - slow_controlled: Медленный контролируемый стиль
   - steady_pace: Ровный темп
   - explosive_bursts: Взрывной стиль с рывками
   - hesitant: Нерешительный стиль
   - variable: Переменный темп

4. TIME ZONES (Распределение времени на стене):
   - upper: % времени в верхней трети стены
   - middle: % времени в средней трети
   - lower: % времени в нижней трети
   - Используй для анализа прогресса по маршруту

5. АНАЛИЗ ЗАЦЕПОВ (если включена детекция Roboflow):
   - holds_used_count: количество использованных зацепов
   - longest_hold_time: время на самом долгом зацепе
   - longest_hold_color: цвет зацепа, на котором задержался дольше всего
   - Используй фразы типа: "ты слишком долго думал на красном зацепе"

ПРИМЕРЫ ИСПОЛЬЗОВАНИЯ В ОТЧЕТЕ:
- "Velocity Ratio 0.3x на кадре #245 указывает на момент нерешительности"
- "Накопленная дистанция 0.52 - выше среднего, много лишних движений"
- "Паттерн 'explosive_bursts' - характерен для силовых скалолазов"
- "67% времени в нижней зоне - проблемы со стартом маршрута"
"""

# Психологические типы (ВСЕГДА КЭШИРУЕТСЯ)
NEURO_TYPES_INFO = """
НЕЙРОТИПЫ СКАЛОЛАЗОВ (4 основных):

1. ФИЛОСОФ 🌊 (Слабый инертный)
   - Характеристики: Спокойный, технический, аналитический
   - Сильные стороны: Планирование, техника, экономия сил
   - Сложности: Медленный темп, избегание риска
   - Идеальные трассы: Технические плиты, микрозацепы
   
2. ВОИН ⚔️ (Сильный неуравновешенный)
   - Характеристики: Агрессивный, силовой, динамичный
   - Сильные стороны: Мощность, скорость, решительность
   - Сложности: Энергозатратность, техника страдает
   - Идеальные трассы: Нависания, силовые трассы

3. АНАЛИТИК 🧠 (Сильный уравновешенный инертный)
   - Характеристики: Методичный, системный, последовательный
   - Сильные стороны: Систематизация, прогресс tracking
   - Сложности: Креативность, адаптация к новому
   - Идеальные трассы: Системные проекты, планомерные тренировки

4. СПРИНТЕР 🚀 (Сильный подвижный неуравновешенный)
   - Характеристики: Быстрый, импульсивный, интуитивный
   - Сильные стороны: Скорость реакции, динамика
   - Сложности: Выносливость, долгосрочное планирование
   - Идеальные трассы: Короткие сложные болдеры
"""

# ============================================
# ЧАСТЬ 2: ПРОМПТЫ ДЛЯ КАЖДОГО ФОРМАТА
# ============================================

FORMAT_PROMPTS = {
    "technical": """
Создай ТЕХНИЧЕСКИЙ отчет с акцентом на:
- Точные цифры и проценты
- Биомеханические термины
- Графики (ASCII art)
- Научные объяснения
- Детальный анализ углов суставов
- Профессиональную терминологию
""",
    
    "client": """
Создай КЛИЕНТСКИЙ отчет с акцентом на:
- Дружелюбный мотивирующий тон
- Эмодзи для визуализации
- "Зоны роста" вместо "проблем"
- Позитивные формулировки
- Конкретные выполнимые советы
- Вдохновение на следующую тренировку
""",
    
    "detective": """
Создай отчет в стиле ДЕТЕКТИВНОГО РАССЛЕДОВАНИЯ:
- "Дело о падении на [время]"
- Хронология событий
- "Улики" из данных
- "Экспертиза" биомеханики
- "Вердикт" и "приговор"
- Драматичный стиль
""",
    
    "gamer": """
Создай ГЕЙМЕРСКИЙ отчет в RPG стиле:
- Персонаж с классом (тип скалолаза)
- Статы: STR, DEX, INT, END, LUCK (0-100)
- "Битва" с трассой (победа/поражение)
- Баффы и дебаффы во время лазания
- Квесты на следующий level
- Достижения разблокированы
- XP и прогресс
""",
    
    "coach": """
Создай ТРЕНЕРСКИЙ отчет с акцентом на:
- Профессиональный тренерский язык
- Биомеханический анализ
- Тренировочные протоколы:
  * МИКРОЦИКЛ (1-2 недели)
  * МЕЗОЦИКЛ (месяц)
- Конкретные упражнения
- Контрольные точки
- Факторы риска травм
""",
    
    "girl_style": """
Создай СТИЛЬНЫЙ отчет для девушек:
- Вдохновляющий поддерживающий тон
- Beauty & wellness метафоры
- "Твоя суперсила", "Glow up план"
- Fashion-подход к технике
- Эмодзи и стиль
- Мантры и affirmations
- Женственные образы
""",
    
    "beginner": """
Создай отчет ДЛЯ НОВИЧКА:
- Максимально простой язык
- Объяснение базовых терминов
- Без сложных концепций
- Всего 1-2 главные задачи
- Короткие простые шаги
- Частая похвала
- Избегай overwhelm
"""
}

# ============================================
# ЧАСТЬ 3: МЕНЕДЖЕР С PROMPT CACHING
# ============================================

class ClaudeManagerWithCaching:
    """Менеджер Claude API с Prompt Caching и Rate Limiting"""
    
    def __init__(
        self, 
        api_key: str,
        max_concurrent: int = 5,
        rpm_limit: int = 1000
    ):
        self.client = anthropic.Anthropic(api_key=api_key)
        self.semaphore = Semaphore(max_concurrent)
        self.request_times = []
        self.rpm_limit = rpm_limit
        
        # Статистика кэширования
        self.cache_stats = {
            'total_requests': 0,
            'cache_hits': 0,
            'tokens_saved': 0
        }
    
    async def generate_report(
        self,
        analysis_data: Dict,
        report_format: str,
        climber_name: str,
        expert: str = None,
        neuro_type: str = None
    ) -> str:
        """
        Генерация отчета с Prompt Caching
        
        Args:
            analysis_data: Данные анализа видео
            report_format: Формат (technical/client/detective/etc)
            climber_name: Имя скалолаза
            expert: Эксперт (если None - выбирается автоматически)
            neuro_type: Нейротип (если None - определяется автоматически)
        
        Returns:
            Сгенерированный отчет
        """
        
        async with self.semaphore:
            # Rate limiting
            await self._check_rate_limit()
            
            try:
                logger.info(f"🔄 Вызываем Claude API с кэшированием...")
                logger.info(f"📝 Параметры: format={report_format}, expert={expert}, neuro={neuro_type}")
                result = await self._generate_with_cache(
                    analysis_data,
                    report_format,
                    climber_name,
                    expert,
                    neuro_type
                )
                logger.info(f"✅ Claude API успешно вернул отчет ({len(result)} символов)")
                return result
            
            except anthropic.RateLimitError as e:
                print(f"⚠️  Rate limit! Waiting 10 seconds...")
                await asyncio.sleep(10)
                return await self.generate_report(
                    analysis_data, report_format, climber_name, expert, neuro_type
                )
            
            except Exception as e:
                print(f"❌ Claude API error: {e}")
                print(f"🔄 Falling back to local generation...")
                # Fallback на локальную генерацию
                return self._generate_fallback_report(
                    analysis_data, report_format, climber_name, expert, neuro_type
                )
    
    async def _generate_with_cache(
        self,
        data: Dict,
        format: str,
        name: str,
        expert: str = None,
        neuro: str = None
    ) -> str:
        """Генерация с использованием кэширования"""
        
        # Автоматический выбор эксперта если не указан
        if not expert:
            expert = self._select_expert(data)
        
        # Автоматическое определение нейротипа
        if not neuro:
            neuro = self._determine_neuro_type(data)
        
        # Строим уникальную часть промпта
        user_prompt = self._build_user_prompt(data, format, name, expert, neuro)
        
        # КЛЮЧЕВОЙ МОМЕНТ: System messages с cache_control
        # Объединяем все системные промпты в одну строку (включая BoulderVision)
        system_prompt = f"{SYSTEM_BASE}\n\n{EXPERTS_INFO}\n\n{FORMATS_INFO}\n\n{NEURO_TYPES_INFO}\n\n{BOULDERVISION_INFO}"
        
        # Вызов API
        response = self.client.messages.create(
            model="claude-sonnet-4-20250514",
            max_tokens=4000,
            system=system_prompt,
            messages=[
                {
                    "role": "user",
                    "content": user_prompt
                }
            ]
        )
        
        # Логируем статистику кэша
        if hasattr(response, 'usage') and response.usage:
            self._log_cache_usage(response.usage)
        
        return response.content[0].text
    
    def _build_user_prompt(
        self, 
        data: Dict, 
        format: str, 
        name: str,
        expert: str,
        neuro: str
    ) -> str:
        """Строит уникальную часть промпта (не кэшируется)"""
        
        # Извлекаем BoulderVision данные если есть
        bv_data = data.get('bouldervision', {})
        holds_data = data.get('holds_analysis', {})
        
        bv_section = ""
        if bv_data:
            bv_section = f"""
BOULDERVISION МЕТРИКИ:
- Средний Velocity Ratio: {bv_data.get('avg_velocity_ratio', 'N/A')}
- Макс. Velocity Ratio: {bv_data.get('max_velocity_ratio', 'N/A')} (кадр #{bv_data.get('peak_velocity_frame', 'N/A')})
- Мин. Velocity Ratio: {bv_data.get('min_velocity_ratio', 'N/A')} (кадр #{bv_data.get('slowest_frame', 'N/A')})
- Накопленная дистанция: {bv_data.get('total_distance', 'N/A')}
- Паттерн движения: {bv_data.get('movement_pattern', 'N/A')}
- Время в зонах: верх {bv_data.get('time_zones', {}).get('upper', 0)}%, середина {bv_data.get('time_zones', {}).get('middle', 0)}%, низ {bv_data.get('time_zones', {}).get('lower', 0)}%
"""
        
        holds_section = ""
        if holds_data and holds_data.get('analysis_available'):
            longest = holds_data.get('longest_hold', {})
            holds_section = f"""
АНАЛИЗ ЗАЦЕПОВ:
- Использовано зацепов: {holds_data.get('total_holds_used', 0)}
- Всего взаимодействий: {holds_data.get('total_interactions', 0)}
- Самый долгий зацеп: {longest.get('color', 'N/A')} цвет, {longest.get('time_seconds', 0):.1f} сек
- Распределение по цветам: {holds_data.get('color_distribution', {})}
"""
        
        return f"""
ДАННЫЕ АНАЛИЗА ВИДЕО:
{json.dumps(data, ensure_ascii=False, indent=2)}
{bv_section}
{holds_section}

ПАРАМЕТРЫ ОТЧЕТА:
- Формат: {format}
- Имя скалолаза: {name}
- Выбранный эксперт: {expert}
- Нейротип: {neuro}

ИНСТРУКЦИИ ПО ФОРМАТУ:
{FORMAT_PROMPTS.get(format, FORMAT_PROMPTS['client'])}

Создай ПОЛНЫЙ отчет в формате "{format}" СЕЙЧАС.
Включи ВСЕ 13 компонентов из списка (включая BoulderVision динамику и анализ зацепов если данные доступны).
Используй РЕАЛЬНЫЕ данные из анализа.
Обязательно интерпретируй BoulderVision метрики если они предоставлены!
"""
    
    def _select_expert(self, data: Dict) -> str:
        """Выбор эксперта на основе результатов"""
        avg_quality = data.get('avg_pose_quality', 70)
        fall_detected = data.get('fall_detected', False)
        
        if avg_quality >= 80:
            return random.choice(['Magnus Midtbø', 'Eric Hörst'])
        elif avg_quality >= 60:
            return random.choice(['Neil Gresham', 'Dave MacLeod'])
        elif fall_detected:
            return random.choice(['Neil Gresham', 'Dave MacLeod'])
        else:
            return random.choice(['Magnus Midtbø', 'Eric Hörst'])
    
    def _determine_neuro_type(self, data: Dict) -> str:
        """Определение нейротипа"""
        avg_quality = data.get('avg_pose_quality', 70)
        avg_intensity = data.get('avg_motion_intensity', 15)
        
        # ФИЛОСОФ: высокая техника, низкая интенсивность
        if avg_quality > 80 and avg_intensity < 20:
            return "ФИЛОСОФ"
        # ВОИН: средняя техника, высокая интенсивность
        elif avg_quality > 70 and avg_intensity > 25:
            return "ВОИН"
        # АНАЛИТИК: очень высокая техника
        elif avg_quality > 85:
            return "АНАЛИТИК"
        # СПРИНТЕР: очень высокая интенсивность
        elif avg_intensity > 30:
            return "СПРИНТЕР"
        else:
            return "ФИЛОСОФ"
    
    async def _check_rate_limit(self):
        """Проверка и ожидание при превышении RPM"""
        now = time.time()
        
        # Убираем запросы старше 1 минуты
        self.request_times = [
            t for t in self.request_times 
            if now - t < 60
        ]
        
        # Если близко к лимиту (оставляем запас 10 запросов)
        if len(self.request_times) >= self.rpm_limit - 10:
            wait = 60 - (now - self.request_times[0])
            if wait > 0:
                print(f"⏳ Rate limit approaching. Waiting {wait:.1f}s...")
                await asyncio.sleep(wait)
        
        # Записываем время запроса
        self.request_times.append(now)
    
    def _log_cache_usage(self, usage):
        """Логирование использования кэша"""
        self.cache_stats['total_requests'] += 1
        
        # В новой версии API структура usage изменилась
        if hasattr(usage, 'cache_read_input_tokens') and usage.cache_read_input_tokens > 0:
            self.cache_stats['cache_hits'] += 1
            self.cache_stats['tokens_saved'] += usage.cache_read_input_tokens
            
            print(f"💰 Cache HIT! Saved {usage.cache_read_input_tokens} tokens")
            print(f"   Stats: {self.cache_stats['cache_hits']}/{self.cache_stats['total_requests']} hits, "
                  f"{self.cache_stats['tokens_saved']} total tokens saved")
        else:
            print(f"🆕 Cache MISS - creating cache")
    
    def _generate_fallback_report(
        self, 
        data: Dict, 
        format: str, 
        name: str,
        expert: str = None,
        neuro_type: str = None
    ) -> str:
        """Fallback генерация отчета без Claude API"""
        
        quality = data.get('avg_pose_quality', 70)
        intensity = data.get('avg_motion_intensity', 15)
        balance = data.get('avg_balance_score', 70)
        overall = data.get('overall_quality', 70)
        frames = data.get('total_frames', 0)
        
        # Прогресс бары
        def progress_bar(value):
            filled = int(value / 10)
            return '█' * filled + '░' * (10 - filled)
        
        report = f"""
🎯 CLIMBAI АНАЛИЗ ДВИЖЕНИЯ (Fallback Mode)

Привет, {name}! 👋

📊 ОСНОВНАЯ СТАТИСТИКА
━━━━━━━━━━━━━━━━━━━━━━
• Кадров проанализировано: {frames}
• Продолжительность: {data.get('duration', 0):.1f}с
• Среднее FPS: {data.get('fps', 30)}

⚡ МАТРИЦА ПРОИЗВОДИТЕЛЬНОСТИ
━━━━━━━━━━━━━━━━━━━━━━
КАЧЕСТВО ПОЗЫ:    {progress_bar(quality)} {quality:.1f}%
ИНТЕНСИВНОСТЬ:    {progress_bar(intensity)} {intensity:.1f}
БАЛАНС:           {progress_bar(balance)} {balance:.1f}%
ОБЩАЯ ОЦЕНКА:     {progress_bar(overall)} {overall:.1f}%

👨‍🏫 ЭКСПЕРТНЫЙ АНАЛИЗ
━━━━━━━━━━━━━━━━━━━━━━
Назначенный эксперт: {expert or 'Система'}
Оценка: {quality:.0f}/100

{self._get_expert_comment(quality, expert)}

🔬 БИОМЕХАНИЧЕСКИЙ АНАЛИЗ
━━━━━━━━━━━━━━━━━━━━━━
Качество детекции: {quality:.1f}%
{self._get_quality_interpretation(quality)}

Интенсивность движений: {intensity:.1f}
{self._get_intensity_interpretation(intensity)}

Баланс тела: {balance:.1f}%
{self._get_balance_interpretation(balance)}

🧠 ПСИХОЛОГИЧЕСКИЙ ПРОФИЛЬ
━━━━━━━━━━━━━━━━━━━━━━
Определенный нейротип: {neuro_type or 'ФИЛОСОФ'}
{self._get_neuro_description(neuro_type)}

🎯 КЛЮЧЕВЫЕ МОМЕНТЫ
━━━━━━━━━━━━━━━━━━━━━━
Лучший кадр: #{data.get('best_frame', {}).get('frame_number', 'N/A')}
Худший кадр: #{data.get('worst_frame', {}).get('frame_number', 'N/A')}

{'🚨 ОБНАРУЖЕНО ПАДЕНИЕ!' if data.get('fall_detected') else '✅ Падений не обнаружено'}

⚡ ПЛАН ДЕЙСТВИЙ
━━━━━━━━━━━━━━━━━━━━━━
🎯 ПРЯМО СЕГОДНЯ (5 минут):
{self._get_immediate_actions(quality, balance)}

📅 НА ЭТОЙ НЕДЕЛЕ:
{self._get_weekly_actions(quality, intensity)}

🚀 НА МЕСЯЦ:
{self._get_monthly_goal(overall)}

━━━━━━━━━━━━━━━━━━━━━━
⚠️  FALLBACK РЕЖИМ: Отчет сгенерирован локально
Claude API недоступен (ошибка 403)
Все метрики и анализ корректны!
━━━━━━━━━━━━━━━━━━━━━━
"""
        return report.strip()
    
    def _get_expert_comment(self, quality: float, expert: str) -> str:
        if quality >= 80:
            return f"Отличная техника! {expert or 'Эксперт'} был бы впечатлен твоей стабильностью."
        elif quality >= 60:
            return f"Хорошая база, но есть над чем работать. {expert or 'Эксперт'} рекомендует больше практики."
        else:
            return f"Техника требует серьезной работы. {expert or 'Эксперт'} советует начать с основ."
    
    def _get_quality_interpretation(self, quality: float) -> str:
        if quality >= 80:
            return "Превосходно! Тело отлично детектируется, поза стабильная."
        elif quality >= 60:
            return "Хорошо. Большинство кадров четкие, есть моменты нестабильности."
        else:
            return "Требуется улучшение. Много кадров с плохой видимостью ключевых точек."
    
    def _get_intensity_interpretation(self, intensity: float) -> str:
        if intensity >= 2.0:
            return "Очень динамичные движения! Высокая активность."
        elif intensity >= 1.0:
            return "Умеренная интенсивность. Сбалансированный темп."
        else:
            return "Низкая интенсивность. Статичные позы или медленные движения."
    
    def _get_balance_interpretation(self, balance: float) -> str:
        if balance >= 80:
            return "Отличный баланс! Центр масс стабилен."
        elif balance >= 60:
            return "Неплохой баланс, но есть моменты нестабильности."
        else:
            return "Баланс требует работы. Центр масс часто смещается."
    
    def _get_neuro_description(self, neuro: str) -> str:
        descriptions = {
            "ФИЛОСОФ": "Спокойный, технический, аналитический подход к лазанию",
            "ВОИН": "Агрессивный, силовой, динамичный стиль",
            "АНАЛИТИК": "Методичный, системный, последовательный",
            "СПРИНТЕР": "Быстрый, импульсивный, интуитивный"
        }
        return descriptions.get(neuro, "Спокойный, технический подход")
    
    def _get_immediate_actions(self, quality: float, balance: float) -> str:
        actions = []
        if quality < 70:
            actions.append("1. Улучши освещение при съемке")
            actions.append("2. Снимай с более выгодного угла")
        else:
            actions.append("1. Сделай разминку 3 минуты")
            actions.append("2. Повтори одно движение 5 раз")
        
        if balance < 70:
            actions.append("3. Постой на одной ноге 30 сек")
        else:
            actions.append("3. Запиши свои ощущения")
        
        return '\n'.join(actions)
    
    def _get_weekly_actions(self, quality: float, intensity: float) -> str:
        actions = ["• Анализируй по 2-3 видео в неделю"]
        
        if quality < 70:
            actions.append("• Работай над стабильностью движений")
        if intensity < 1.5:
            actions.append("• Добавь динамических упражнений")
        
        return '\n'.join(actions)
    
    def _get_monthly_goal(self, overall: float) -> str:
        target = overall + 10
        return f"• Достичь общей оценки {target:.0f}% (сейчас {overall:.1f}%)"

    def get_cache_stats(self) -> Dict:
        """Получить статистику кэширования"""
        if self.cache_stats['total_requests'] == 0:
            return self.cache_stats
        
        hit_rate = self.cache_stats['cache_hits'] / self.cache_stats['total_requests'] * 100
        
        # Примерная экономия (cache read стоит ~10% от обычного input)
        savings_estimate = self.cache_stats['tokens_saved'] * 0.003 * 0.9  # 90% экономия
        
        return {
            **self.cache_stats,
            'hit_rate': f"{hit_rate:.1f}%",
            'estimated_savings': f"${savings_estimate:.3f}"
        }

# ============================================
# ЧАСТЬ 4: ИНТЕГРАЦИЯ В БОТ
# ============================================

# Инициализация менеджера (ОДИН РАЗ при старте бота)
import random
import os

# API ключ из переменных окружения
API_KEY = os.getenv("ANTHROPIC_API_KEY")

if not API_KEY:
    raise ValueError("ANTHROPIC_API_KEY не установлен!")

claude_manager = ClaudeManagerWithCaching(
    api_key=API_KEY,
    max_concurrent=5,      # Макс 5 одновременных запросов
    rpm_limit=1000         # Tier 2 = 1000 RPM
)

# Использование в обработчике видео
async def handle_video_analysis(video_results, user_name, selected_format="client"):
    """
    Пример использования в боте
    
    Args:
        video_results: Результаты анализа видео (dict)
        user_name: Имя пользователя
        selected_format: Формат отчета
    """
    
    try:
        # Генерируем отчет
        report = await claude_manager.generate_report(
            analysis_data=video_results,
            report_format=selected_format,
            climber_name=user_name
        )
        
        # Показываем статистику кэша (для дебага)
        stats = claude_manager.get_cache_stats()
        print(f"\n📊 Cache Stats: {stats}")
        
        return report
        
    except Exception as e:
        print(f"❌ Error generating report: {e}")
        return None


# ============================================
# ПРИМЕР ИСПОЛЬЗОВАНИЯ
# ============================================

async def example_usage():
    """Пример как использовать"""
    
    # Пример данных анализа
    fake_analysis = {
        'avg_pose_quality': 81.4,
        'avg_motion_intensity': 16.6,
        'total_frames': 265,
        'duration': 10.6,
        'fall_detected': True,
        'fall_timestamp': 21.07,
        'best_frame': {'frame': 545, 'quality': 98},
        'worst_frame': {'frame': 1270, 'quality': 51}
    }
    
    # Генерируем разные форматы
    formats = ['client', 'technical', 'gamer']
    
    for fmt in formats:
        print(f"\n{'='*50}")
        print(f"Generating {fmt} report...")
        print(f"{'='*50}\n")
        
        report = await claude_manager.generate_report(
            analysis_data=fake_analysis,
            report_format=fmt,
            climber_name="Виталий"
        )
        
        print(report[:500])  # Первые 500 символов
        print("\n...")
    
    # Итоговая статистика
    final_stats = claude_manager.get_cache_stats()
    print(f"\n{'='*50}")
    print(f"FINAL CACHE STATISTICS:")
    print(f"{'='*50}")
    for key, value in final_stats.items():
        print(f"{key}: {value}")


if __name__ == "__main__":
    # Запуск примера
    asyncio.run(example_usage())
